Из Command Prompt для вывода адреса указанного сервера:
PC> nslookup <name_of_server.gg.vp>

Вывод списка адресов в трассировке до указанного пути:
PC> tracert <name_of_server.gg.vp>

11111111 11111111 11111111 10000000 - /25
255.255.255.128

Сетевая конфигурацию устройства:
PC> ipconfig


11111111 11111111 11111000 00000000/21
255.255.240.0

Настройка статического маршрута:
Router(conf)# ip route network-address-destination subnet-mask {ip-address | intefrace} [distance]
network-address-destination - адрес удаленной сети назначения, 
							  который необходимо добавить в таблицу маршрутизации;  
							 (данный параметр часто называют префиксом)
							 
subnet-mask -- маска подсети или просто маска удаленной сети, 
		       которую необходимо добавить в таблицу маршрутизации. 
		       Маску подсети можно изменить для объединения группы сетей.
		       
ip-address  -  IP-адрес подключаемого маршрутизатора, 
			   который используется для пересылки пакетов в удаленную сеть назначения. 
			   Такой IP-адрес чаще всего называют следующим переходом или следующим узлом. 
			  
exit-intf – выходной интерфейс для пересылки пакетов в сеть назначения
			(напрямую подключенный статический маршрут) (конф. точка-точка)
			
distance - создание плавающего статического маршрута 
           путём назначения административного расстояния.



Рекурсивный статический маршрут - зависит от маршрутизатора следующего перехода, 
чтобы пакеты отправлялись по назначению. (требует двух поисков по таблице):
1. Поиск для сети назначения 
2. Поиск интерфейса/ip-addres'а для маршрутизатора следующего перехода

Настройка статического маршрута следующего перехода(рекурсивный):
Router(conf)# ip route network-address-destination subnet-mask ip-address

Настройка статического маршрута с прямым подключением:
Router(conf)# ip route network-address-destination subnet-mask intefrace

Статический маршрут с прямым подключением смотрит свой выходной интерфейс 
(для отправки пакетов по назначению),
рекурсивный статический маршрут смотрит IP-адрес маршрутизатора следующего перехода.

Показать сети, подключенные напрямую (буква C):
Router# show ip rounte connected

Показать статические маршруты (буква S):
Router# show ip rounte static

Настройка маршрута по умолчанию (маршрут последней надежды) (буква S*)
R3(config)#ip route 0.0.0.0 0.0.0.0 Serial 0/0/1

----------------------------------------------------------------------------------
Отслеживание пути от отправителя к месту назначения:
PC> tracert 198.0.0.10

Административное расстояние статического маршрута:

EIGRP = 90



-------------------------------------------------------------------------------------
Сеть VLAN создаётся  - для уменьшения размера широковещательных доменов 
на коммутаторе 2-го уровня
и на устройстве 3-го уровня.
=> делит сеть на сегменты
для облегчения процесса достижения целей организации 
(исп. в коммунируемых локальных сетях: 
отделы бухгалтерии, программистов, менеджеров и т.д.)
 *для передачи трафика между сегментами требуется процесс 3-го уровня*
 
 
        CISCO CATALYST
Стандартный диапазон для виртуальных локальных сетей (VLAN) - 1-1005 
(1002-1005 -- зарезервированны для сетей VLAN типа Token Ring и FDDI)
Конфигурации VLAN хранятся в файле vlan.dat на коммутаторе.

Расширенный диапазон -- 1006-3094
4096 - максимальное кол-во VLAN, т.к. в поле идентификатора VLAN 
заголовка IEEE 802.1Q насчитывается 12 бит

----> Switch# show vlan brief # отображает содержимое файла vlan.brief

Создание или вход в VLAN
----> Switch(config)# vlan [name, list_of_name, interval]
----> Example: Switch(config)# vlan 100, 102, 105-107
-------------> Switch(config-vlan)# name [name]
                                    end
                                    
Назначение портов сетям VLAN
----> Switch(config)# interface interface_id
----> Switch(config-if)# switchport mode access # переводит порт в режим доступа
                         switchport access vlan vlan_id # назначает порт сети VLAN
                         end








































