Из Command Prompt для вывода адреса указанного сервера:
PC> nslookup <name_of_server.gg.vp>

Вывод списка адресов в трассировке до указанного пути:
PC> tracert <name_of_server.gg.vp>

11111111 11111111 11111111 10000000 - /25
255.255.255.128

Сетевая конфигурацию устройства:
PC> ipconfig


11111111 11111111 11111000 00000000/21
255.255.240.0

Настройка статического маршрута:
Router(conf)# ip route network-address-destination subnet-mask {ip-address | intefrace}

Рекурсивный статический маршрут - зависит от маршрутизатора следующего перехода, 
чтобы пакеты отправлялись по назначению. (требует двух поисков по таблице):
1. Поиск для сети назначения 
2. Поиск интерфейса/ip-addres'а для маршрутизатора следующего перехода

Настройка статического маршрута следующего перехода(рекурсивный):
Router(conf)# ip route network-address-destination subnet-mask ip-address

Настройка статического маршрута с прямым подключением:
Router(conf)# ip route network-address-destination subnet-mask intefrace

Статический маршрут с прямым подключением смотрит свой выходной интерфейс 
(для отправки пакетов по назначению),
рекурсивный статический маршрут смотрит IP-адрес маршрутизатора следующего перехода.

Показать сети, подключенные напрямую (буква C):
Router# show ip rounte connected

Показать статические маршруты (буква S):
Router# show ip rounte static

Настройка маршрута по умолчанию (маршрут последней надежды) (буква S*)
R3(config)#ip route 0.0.0.0 0.0.0.0 Serial 0/0/1

----------------------------------------------------------------------------------
Отследивание пути от отправителя к месту назначения:
PC> tracert 198.0.0.10

Административное расстояние статического маршрута:





